# Лекция 1.
## Знакомство с языком C#

* Языков программирования много, C# один из наиболее популярных.
* Позволяет писать проекты практически под любую пплатформу (от мобильного телефона до оборудования)
* C# - ответ Microsoft языку Java

* **Язык программирования - это инструмент**, программирование не ограничивается синтаксисом языка.

* Цель курса - понять алгоритмы.

## Этапы написания программы:

* Получить задачу
* Обдумать условие
* Уточнить условие
* Составить алгоритм
* Уточнить алгоритм
* Исправить алгоритм
* Перепроверить алгоритм
* Писать код

* Программа состоит из интерфейса, логики и данных. Программа получает информацию на ввод, обрабатывает и возвращает обработанные данные.

## Написать программу "Hello World"

* Начинаем все равно с алгоритма.
* dotnet new console - создает проект
* dotnet run - запускает программу

Console.WriteLine("Hello, World!");
* Console - это окно терминала. В нашем случае работаем с терминалом.
* WriteLine - Команда вывода сообщения в терминале целой строкой
* ("Hello, World"); - текст, пишется внутри скобок. В конце строки всегда ";"

## Написать программу "Приветствие пользователя"

Алгоритм:
* Начало
* Ввести <имя пользователя>
* Вывести "Привет, "
* Вывести <имя пользователя>
* Конец

string username = Console.Readline();
* string указывает типа данных (в нашем примере - строка)
* username - название переменной, в которую мы будем записывать имя пользователя
* = не знак равенства, а знак присваивания. Равенство обозначается "=="

* Console.WriteLine("Введите ваше имя"); - приглашение ко вводу, без этой строки юзер не понимает что делать.
* Итоговый вид программы:

Console.WriteLine("Введите ваше имя");

string username = Console.Readline();

Console.WriteLine("Привет, ");

Console.WriteLine(username);

* Как улучшить?
* Использовать Console.Write - Без переноса строки
* Написать в одной строке:

Console.Write("Привет, " + username);

## Написать программу сложения двух чисел

* Уточняем язык, на котором необходимо написать (C#)
* Уточняем для какой среды пишем программу (Windows & MacOS)
* Уточняем, откуда берутся данные (Вводит пользователь)
* Уточняем, куда записать результат (Выводим в консоль)
* Уточняем тип чисел, с которыми будем работать (Целые)
* Составляем алгоритм решения:

Начало

Определить первое число

Определить второе число

Вывести сумму на экран

Конец

* Пишем код!

int numberA = 3;

int numberB = 5;

Console.WriteLine(numberA + numberB);

* int - наименование типа переменной integer, целые числа.
* Наименование переменных с использованием camelCase
* Вариант с дополнительной переменной:

int result = numberA + numberB;

Console.WriteLine(result);

## Написать программу на языке C#, в которую пользователь вводит два целых числа и получает частное введенных чисел

* По аналогии с нахождением суммы:

int numberA = 12;

int numberB = 5;

Console.WriteLine(numberA / numberB);

* С типом целых чисел int работать не будет! Необходимо использовать double

double numberA = 12;

double numberB = 5;

Console.WriteLine(numberA / numberB);

* Диапазон значений типа данных int - от -2147483649 до 2147483647, т.е. 32 разрядное число и знак.
* Диапазон значений double - 64 разрядное число со знаком, очень большое.
* Резервируют сильно разный объем памяти!
* string - строка, от 4 байт до 2 Гб
* bool - true и false, вес 1 байт

* Для случайного числа от min до max - 1

new Random().Next(min, max)

## Написать приложение для приветсвия пользователя-любимчика

* Алгоритм:

Начало

Ввести имя пользователя

Если имя пользователя "Маша", то поприветствовать по-особенному

Иначе поприветствовать по-обычному

Конец

* Синтаксис:
if(условие)

{

    Набор действий 1

}

else

{

    Набор действий 2

}
* Программа:

Console.Write("Введите имя пользователя");

string username = Console.ReadLine();

if(username == "Маша")

{

    Console.WriteLine("Ура, это же МАША!")
}

else

{

    Console.WriteLine("Привет, " + username);
}

* Маша может написать себя как мАША, маша МаШа и т.д. Исправить так:

if(username.ToLower() == "маша")

## Решение задачи с перетаскиванием гирек

int a = 1;

int b = 2;

int c = 6;

int d = 8;

int e = 4;

int max = a;

if (a > max) max = a;

if (b > max) max = b;

if (c > max) max = c;

if (d > max) max = d;

if (e > max) max = e;

Console.Write("max = ");

Console.WriteLine(max);

* Что делать, если одно и то же действие надо делать много раз? Использовать **оператор цикла**

## Увлекательная задача про точки

* Алгоритм:

1. Определить три точки
2. Выбрать две любых
3. Найти середину
4. Поставить точку
5. Выбрать случайную вершину треугольника
6. Соединить ее с полученной на 4 шаге точкой
7. Перейти к шагу 3
8. **Шаги 3 - 7 повторить N раз**
* Цикл while:

while(условие продолжения)

{

    Набор действий

}

int count = 0;

*Пример:

while(count < 100)

{

    Набор действйи
    count = count + 1

}

* Кодим:

int xa = 40, ya = 1, xb = 1, yb = 30, xc = 80, yc = 30;

Console.SetCursorPosition(xa, ya);

Console.WriteLine("+");

Console.SetCursorPosition(xb, yb);

Console.WriteLine("+");

Console.SetCursorPosition(xc, yc);

Console.WriteLine("+");

int x = xa, y = xb;

int count = 0;

while(count < 10000)

{

    int what = new Random().Next(0, 3);
    if(what == 0)
    {
        x = (x + xa)/2;
        y = (y + ya)/2
    }
    if(what == 1)
    {
        x = (x + xb)/2;
        y = (y + yb)/2
    }
    if(what == 2)
    {
        x = (x + xc)/2;
        y = (y + yc)/2
    }
    Console.SetCursorPosition(x, y);
    Console.WriteLine("+");
    count++;
}
* count++ - сокращение для count = count + 1
* Результат - фрактальное изображение треугольника Серпинского